tsung_tests/read_post.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="Ryan.nscn823fdv.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>

    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
  
    <arrivalphase phase="3" duration="10" unit="second">
      <users arrivalrate="64" unit="second"/>
    </arrivalphase>

    <arrivalphase phase="4" duration="10" unit="second">
      <users arrivalrate="128" unit="second"/>
    </arrivalphase>

    <arrivalphase phase="5" duration="10" unit="second">
      <users arrivalrate="300" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="Read post feed" probability="100" type="ts_http">
      <request>
        <http url="/posts" version="1.1" method="GET"/>
      </request>
    </session>
  </sessions>
</tsung>